Τέχνη και ζωή παντρεύονται με φόντο τον <<Πήτερ Παν>> 18/2/2005 
Ο Τζέιμς Μ. Μπάρυ, ένας Σκωτσέζος θεατρικός συγγραφέας, βλέπει το τελευταίο του έργο να προκαλεί αρνητικά σχόλια από την αριστοκρατία της εποχής.
Ψάχνοντας μία εμπνευσμένη ιδέα για το επόμενό του πόνημα, συναντά σ' έναν περίπατό του στο πάρκο την οικογένεια Λιούελιν Ντέιβις.
Τα τέσσερα μικρά αγόρια της οικογένειας παίζουν ανέμελα παρουσία της μητέρας τους και προσφάτως χήρας, Σίλβια Ντι Μοριέ.
Ο Τζέιμς όχι μόνο συμμετέχει στο παιχνίδι τους, αλλά το εξελίσσει, δίνοντάς του παραμυθένιες διαστάσεις.
Παρά την αντίδραση της μητέρας της Σίλβια, Εμμα, ο Τζέιμς θα γίνει ο πιο κολλητός και.. ενδιαφέρων φίλος της οικογένειας Λιούελιν Ντέιβις, και σκηνές από την καθημερινή της ζωή θα τον εμπνεύσουν να γράψει τη μεγαλύτερη καλλιτεχνική και εμπορική επιτυχία του, τον <<Πήτερ Παν>>...
Μία ιστορία που υμνεί τη δύναμη της πίστης και την παιδική αθωότητα με τον πιο γλυκό και τρυφερό τρόπο, αποφεύγοντας πολλές φορές κλισέ που θα ήταν ίσως αναμενόμενα σε μία τέτοια δημιουργία. 
Το σενάριο του Ντέιβιντ Μαγκί είναι βασισμένο στο θεατρικό έργο του Αλαν Νι <<Ο άντρας που ήταν ο Πήτερ Παν>>, το οποίο με τη σειρά του έχει μυθοπλαστικό χαρακτήρα και τα όσα διηγείται δεν έχουν συμβεί στην πραγματικότητα.
Το μόνο αληθινό στοιχείο τόσο του θεατρικού έργου όσο και του σεναρίου είναι η δεδομένη γνωριμία του Τζέιμς Μ. Μπάρυ με την οικογένεια Λιούελιν Ντέιβις.
Το <<Ψάχνοντας τη Χώρα του Ποτέ>> λοιπόν σε καμία περίπτωση δεν είναι μία βιογραφική ταινία γύρω από τα έργα και τις ημέρες του συγγραφέα του <<Πήτερ Παν>>. 
Είναι μια ταινία που εμπνέεται από τη σχέση του Μπάρυ με την οικογένεια Λιούελιν Ντέιβις για να δημιουργήσει το δραματουργικό της πλαίσιο.
Η τέχνη και η ζωή παντρεύονται με φόντο τον <<Πήτερ Παν>>.
Η αχαλίνωτη φαντασία του Μπάρυ δε σταματά στα όρια της σκηνής και της συγγραφής.
Είναι πανταχού παρούσα σε κάθε σκηνή της καθημερινής του ζωής.
Ο Τζέιμς Μπάρυ αρνείται να μεγαλώσει, εμμένει στην παιδική αθωότητα και με αρωγούς τους <<σκανταλιάρηδες>> μπόμπιρες της οικογένειας Λιούελιν Ντέιβις δημιουργεί ένα παράθυρο στο όνειρο ταξιδεύοντάς μας στη Χώρα του Ποτέ.
Ο σκηνοθέτης Μαρκ Φόστερ κατάλαβε από την πρώτη στιγμή ότι έχει να κάνει με μία ταινία που χωρίς να χάνει την επαφή της με την πραγματικότητα πρέπει να δανείζεται λίγη από τη μαγεία του <<Πήτερ Παν>>. 
Φρόντισε λοιπόν να χαρίσει στη ταινία του μία παραμυθένια ατμόσφαιρα και να κορυφώσει αργά, αλλά σταθερά, τη συγκινησιακή φόρτιση. 
Διότι για ένα πράγμα να είστε σίγουροι. Τα χαρτομάντηλα θα σας χρειαστούν σε αυτή την ταινία! Παράλληλα όμως σκιαγράφησε εύστοχα τη σύγκρουση λογικής και φαντασίας, πραγματικότητας και ουτοπίας υπερασπίζοντας το δικαίωμα όλων μας στο όνειρο.
Συμπαθέστατος ο Τζόνι Ντεπ στον ρόλο του Μπάρυ, μεταδίδει στο ακέραιο την άρνηση του ήρωα να μεγαλώσει και τη πεποίθηση ότι παραμένει ένα μεγάλο παιδί. 
Επίσης απορώ: Τον αγέραστο έχει αυτός ο άνθρωπος; Έκοψε πάλι το μαλλί και δεν τον κάνεις πάνω από 25. 
Η Κέιτ Γουίνσλετ υπηρετεί με συνέπεια τον ρόλο της, ενώ οι μικροί πρωταγωνιστές (και ειδικότερα ο μικρότερος όλων) κλέβουν καρδιές.
Μια ταινία, που ίσως να είναι υπερβολή να είναι προτεινόμενη για 7 Οσκαρ, αλλά ωστόσο παραμένει συμπαθέστατη, συγκινητική και εξαιρετικά φροντισμένη από κάθε άποψη.
Γρίφοι έμπνευσης (Οι αστερίσκοι στο πλάι των επικεφαλίδων υποδεικνύουν τον βαθμό δυσκολίας του κάθε γρίφου).
